/* errAuthorizationInvalidSet */
"-60001" = "Die Identifizierungsrechte sind ungültig.";

/* errAuthorizationInvalidRef */
"-60002" = "Die Identifizierungsreferenz ist ungültig.";

/* errAuthorizationInvalidTag */
"-60003" = "Das Identifizierungsattribut ist ungültig.";

/* errAuthorizationInvalidPointer */
"-60004" = "Die zurückgesendete Identifizierung ist ungültig.";

/* errAuthorizationDenied */
"-60005" = "Die Identifizierung wurde verweigert.";

/* errAuthorizationCanceled */
"-60006" = "Die Identifizierung wurde vom Benutzer abgebrochen.";

/* errAuthorizationInteractionNotAllowed */
"-60007" = "Die Identifizierung wurde verweigert, da keine Benutzerinteraktion möglich war.";

/* errAuthorizationInternal */
"-60008" = "Erforderliche Rechte für diesen Vorgang nicht erhalten.";

/* errAuthorizationExternalizeNotAllowed */
"-60009" = "Die Identifizierung darf nicht in ein externes Format konvertiert werden.";

/* errAuthorizationInternalizeNotAllowed */
"-60010" = "Die Identifizierung darf nicht aus einem externen Format erstellt werden.";

/* errAuthorizationInvalidFlags */
"-60011" = "Die verfügbaren Optionsmarkierungen für diesen Identifizierungsvorgang sind ungültig.";

/* errAuthorizationToolExecuteFailure */
"-60031" = "Das angegebene Programm konnte nicht ausgeführt werden.";

/* errAuthorizationToolEnvironmentError */
"-60032" = "Beim Ausführen eines privilegierten Tools wurde ein ungültiger Status gemeldet.";

/* errAuthorizationBadAddress */
"-60033" = "Die angeforderte Socket-Adresse ist ungültig. Sie muss zwischen 0 und 1023 (einschließlich) liegen.";

/* errSSLProtocol */
"-9800" = "SSL-Protokollfehler";

/* errSSLNegotiation */
"-9801" = "Cipher Suite negotiation failure";

/* errSSLFatalAlert */
"-9802" = "Schwerwiegende Warnung";

/* errSSLWouldBlock */
"-9803" = "I/O-Blockierung (nicht schwerwiegend)";

/* errSSLSessionNotFound */
"-9804" = "Versuch, eine unbekannte Session wiederherzustellen";

/* errSSLClosedGraceful */
"-9805" = "Verbindung fehlerfrei getrennt";

/* errSSLClosedAbort */
"-9806" = "Verbindung aufgrund eines Fehlers getrennt";

/* errSSLXCertChainInvalid */
"-9807" = "ungültige Zertifikatskette";

/* errSSLBadCert */
"-9808" = "Ungültiges Zertifikatsformat";

/* errSSLCrypto */
"-9809" = "Zugrundeliegender kryptografischer Fehler";

/* errSSLInternal */
"-9810" = "Interner Fehler";

/* errSSLModuleAttach */
"-9811" = "Fehler beim Anhängen des Moduls";

/* errSSLUnknownRootCert */
"-9812" = "Gültige Zertifikatskette, Root unzuverlässig";

/* errSSLNoRootCert */
"-9813" = "Zertifikatskette vom Root nicht bestätigt";

/* errSSLCertExpired */
"-9814" = "Die Kette enthielt ein abgelaufenes Zertifikat";

/* errSSLCertNotYetValid */
"-9815" = "Die Kette enthielt ein noch nicht gültiges Zertifikat";

/* errSSLClosedNoNotify */
"-9816" = "Server hat die Session ohne Benachrichtigung beendet";

/* errSSLBufferOverflow */
"-9817" = "Ungenügender Puffer";

/* errSSLBadCipherSuite */
"-9818" = "Ungültige SSLCipherSuite";

/* errSSLPeerUnexpectedMsg */
"-9819" = "Unerwartete Nachricht erhalten";

/* errSSLPeerBadRecordMac */
"-9820" = "Ungültiger MAC";

/* errSSLPeerDecryptionFail */
"-9821" = "Entschlüsselung fehlgeschlagen";

/* errSSLPeerRecordOverflow */
"-9822" = "Datensatz-Überlauf";

/* errSSLPeerDecompressFail */
"-9823" = "Fehler bei der Dekomprimierung";

/* errSSLPeerHandshakeFail */
"-9824" = "Fehler beim Handshake";

/* errSSLPeerBadCert */
"-9825" = "Sonstiges ungültiges Zertifikat";

/* errSSLPeerUnsupportedCert */
"-9826" = "Ungültiges, nicht unterstütztes Zertifikatformat";

/* errSSLPeerCertRevoked */
"-9827" = "Zertifikat wurde widerrufen";

/* errSSLPeerCertExpired */
"-9828" = "Zertifikat abgelaufen";

/* errSSLPeerCertUnknown */
"-9829" = "Unbekanntes Zertifikat";

/* errSSLIllegalParam */
"-9830" = "Ungültiger Parameter";

/* errSSLPeerUnknownCA */
"-9831" = "Unbekannte Zertifizierungsinstanz";

/* errSSLPeerAccessDenied */
"-9832" = "Zugriff verweigert";

/* errSSLPeerDecodeError */
"-9833" = "Fehler beim Decodieren";

/* errSSLPeerDecryptError */
"-9834" = "Fehler beim Entschlüsseln";

/* errSSLPeerExportRestriction */
"-9835" = "Exporteinschränkung";

/* errSSLPeerProtocolVersion */
"-9836" = "Ungültige Protokollversion";

/* errSSLPeerInsufficientSecurity */
"-9837" = "Ungenügende Sicherheit";

/* errSSLPeerInternalError */
"-9838" = "Interner Fehler";

/* errSSLPeerUserCancelled */
"-9839" = "Vom Benutzer abgebrochen";

/* errSSLPeerNoRenegotiation */
"-9840" = "Kein Neuverhandlung zulässig";

/* errSSLServerAuthCompleted */
"-9841" = "Serverzertifikat ist gültig oder wurde ignoriert, falls die Überprüfung deaktiviert wurde";

/* errSSLClientCertRequested */
"-9842" = "Server hat ein Client-Zertifikat angefordert";

/* errSSLHostNameMismatch */
"-9843" = "Name der Gegenstelle stimmt nicht überein";

/* errSSLConnectionRefused */
"-9844" = "Gegenstelle trennte vor dem Antworten die Verbindung";

/* errSSLDecryptionFail */
"-9845" = "Fehler beim Entschlüsseln";

/* errSSLBadRecordMac */
"-9846" = "Ungültiger MAC";

/* errSSLRecordOverflow */
"-9847" = "Datensatz-Überlauf";

/* errSSLBadConfiguration */
"-9848" = "Konfigurationsfehler";

/* errSecSuccess */
"0" = "Kein Fehler.";

/* errSecUnimplemented */
"-4" = "Funktion oder Vorgang nicht implementiert.";

/* errSecParam */
"-50" = "Mindestens ein an eine Funktion übergebener Parameter ist ungültig.";

/* errSecAllocate */
"-108" = "Konnte keinen Speicher belegen.";

/* errSecNotAvailable */
"-25291" = "Kein Schlüsselbund verfügbar. Möglicherweise müssen Sie Ihren Computer neu starten.";

/* errSecReadOnly */
"-25292" = "Dieser Schlüsselbund kann nicht geändert werden.";

/* errSecAuthFailed */
"-25293" = "Der eingegebene Benutzername oder das Kennwort ist ungültig.";

/* errSecNoSuchKeychain */
"-25294" = "Der angegebene Schlüsselbund wurde nicht gefunden.";

/* errSecInvalidKeychain */
"-25295" = "Der angegebene Schlüsselbund ist keine gültige Schlüsselbunddatei.";

/* errSecDuplicateKeychain */
"-25296" = "Es gibt bereits einen Schlüsselbund mit diesem Namen.";

/* errSecDuplicateCallback */
"-25297" = "Die angegebene Rückruffunktion ist bereits installiert.";

/* errSecInvalidCallback */
"-25298" = "Die angegebene Rückruffunktion ist nicht gültig.";

/* errSecDuplicateItem */
"-25299" = "Das angegebene Objekt befindet sich bereits im Schlüsselbund.";

/* errSecItemNotFound */
"-25300" = "Das angegebene Objekt konnte nicht im Schlüsselbund gefunden werden.";

/* errSecBufferTooSmall */
"-25301" = "Es ist nicht genügend Arbeitsspeicher verfügbar, um das angegebene Objekt zu verwenden.";

/* errSecDataTooLarge */
"-25302" = "Das Objekt enthält Informationen, die zu groß oder in einem Format sind, das nicht dargestellt werden kann.";

/* errSecNoSuchAttr */
"-25303" = "Das angegebene Attribut existiert nicht.";

/* errSecInvalidItemRef */
"-25304" = "Das angegebene Objekt ist nicht mehr gültig. Möglicherweise wurde es aus dem Schlüsselbund gelöscht.";

/* errSecInvalidSearchRef */
"-25305" = "Der aktuelle Schlüsselbund kann nicht durchsucht werden.";

/* errSecNoSuchClass */
"-25306" = "Das angegebene Objekt ist anscheinend kein gültiges Schlüsselbundobjekt.";

/* errSecNoDefaultKeychain */
"-25307" = "Es wurde kein Standard-Schlüsselbund gefunden.";

/* errSecInteractionNotAllowed */
"-25308" = "Benutzerinteraktion ist nicht zulässig.";

/* errSecReadOnlyAttr */
"-25309" = "Das angegebene Attribut konnte nicht geändert werden.";

/* errSecWrongSecVersion */
"-25310" = "Dieser Schlüsselbund wurde von einer anderen Version der Systemsoftware erstellt und kann nicht geöffnet werden.";

/* errSecKeySizeNotAllowed */
"-25311" = "Dieses Objekt gibt eine zu große Schlüssellänge an.";

/* errSecNoStorageModule */
"-25312" = "Eine erforderliche Komponente (Datenspeichermodul) konnte nicht geladen werden. Möglicherweise müssen Sie Ihren Computer neu starten.";

/* errSecNoCertificateModule */
"-25313" = "Eine erforderliche Komponente (Zertifizierungsmodul) konnte nicht geladen werden. Möglicherweise müssen Sie Ihren Computer neu starten.";

/* errSecNoPolicyModule */
"-25314" = "Eine erforderliche Komponente (Richtlinienmodul) konnte nicht geladen werden. Möglicherweise müssen Sie Ihren Computer neu starten.";

/* errSecInteractionRequired */
"-25315" = "Benutzerinteraktion ist erforderlich, jedoch zurzeit nicht zulässig.";

/* errSecDataNotAvailable */
"-25316" = "Der Inhalt dieses Objekts kann nicht abgerufen werden.";

/* errSecDataNotModifiable */
"-25317" = "Der Inhalt dieses Objekts kann nicht geändert werden.";

/* errSecCreateChainFailed */
"-25318" = "Eines oder mehrere der Zertifikate, die zur Überprüfung dieses Zertifikats erforderlich sind, können nicht gefunden werden.";

/* errSecInvalidPrefsDomain */
"-25319" = "Die angegebene Einstellungs-Domain ist nicht gültig.";

/* errSecACLNotSimple */
"-25240" = "Die angegebene Zugriffssteuerungsliste hat keine (einfache) Standardform.";

/* errSecPolicyNotFound */
"-25241" = "Die angegebene Richtlinie kann nicht gefunden werden.";

/* errSecInvalidTrustSetting */
"-25242" = "Die angegebene Vertrauenseinstellung ist ungültig.";

/* errSecNoAccessForItem */
"-25243" = "Das angegebene Objekt hat keine Zugriffssteuerung.";

/* errSecInvalidOwnerEdit */
"-25244" = "Der Versuch, den Benutzer dieses Objekts zu ändern, ist ungültig.";

/* errSecTrustNotAvailable */
"-25245" = "Es sind keine Vertrauensergebnisse verfügbar.";

/* errSecUnsupportedFormat */
"-25256" = "Das Import-/Exportformat wird nicht unterstützt.";

/* errSecUnknownFormat */
"-25257" = "Unbekanntes Importformat.";

/* errSecKeyIsSensitive */
"-25258" = "Die Schlüsseldaten müssen für den Export eingepackt werden.";

/* errSecMultiplePrivKeys */
"-25259" = "Es wurde versucht, mehrere private Schlüssel zu importieren.";

/* errSecPassphraseRequired */
"-25260" = "Für den Import/Export wird ein Kennwort benötigt.";

/* errSecInvalidPasswordRef */
"-25261" = "Die Kennwortreferenz ist ungültig.";

/* errSecInvalidTrustSettings */
"-25262" = "Der Datensatz der Vertrauenseinstellungen wurde beschädigt.";

/* errSecNoTrustSettings */
"-25263" = "Es wurden keine Vertrauenseinstellungen gefunden.";

/* errSecPkcs12VerifyFailure */
"-25264" = "Die MAC-Überprüfung während des PKCS12-Imports ist fehlgeschlagen.";

/* errSecDecode */
"-26275" = "Bereitgestellte Daten konnten nicht decodiert werden.";

/* CSSMERR_CSP_INVALID_DATA_COUNT */
"-2147415768" = "CSP: Vektor von Puffer-Fehlerwerten";

/* CSSMERR_CSP_INVALID_CONTEXT */
"-2147415760" = "CSP: kryptografische Kontext-Fehlerwerte";

/* CSSMERR_CSP_STAGED_OPERATION_IN_PROGRESS */
"-2147415736" = "CSP: gestaffelte kryptografische API-Fehlerwerte";

/* CSSMERR_CSP_APPLE_PUBLIC_KEY_INCOMPLETE */
"-2147415039" = "* Es wurde versucht, einen öffentlichen Schlüssel zu verwenden, der nicht vollständig ist * wegen fehlenden Algorithmus-spezifischen Parametern.";

/* CSSMERR_CSP_APPLE_SIGNATURE_MISMATCH */
"-2147415038" = "Ein Abgleich der Code-Signatur ist fehlgeschlagen";

/* CSSMERR_CSP_APPLE_INVALID_KEY_START_DATE */
"-2147415037" = "„StartDate/EndDate“ des Schlüssels ist ungültig";

/* CSSMERR_CSPDL_APPLE_DL_CONVERSION_ERROR */
"-2147415035" = "Fehlercodes für Schlüsselbund-Synchronisierung";

/* CSSMERR_CSP_APPLE_SSLv2_ROLLBACK */
"-2147415034" = "SSLv2 Padding Check: Rollback-Attack festgestellt";

/* CSSMERR_APPLEDL_INVALID_OPEN_PARAMETERS */
"-2147412992" = "Das Argument „OpenParameters“, das an „CSSM_DL_DbCreate“ oder „CSSM_DL_DbOpen“ übergeben wurde, war weder „NULL“ noch verwies es auf eine gültige „CSSM_APPLEDL_OPEN_PARAMETERS“-Struktur.";

/* CSSMERR_APPLEDL_DISK_FULL */
"-2147412991" = "Ein Vorgang fehlgeschlagen: Festplatte ist voll";

/* CSSMERR_APPLEDL_QUOTA_EXCEEDED */
"-2147412990" = "Ein Vorgang ist fehlgeschlagen - Festplattenkontingent überschritten";

/* CSSMERR_APPLEDL_FILE_TOO_BIG */
"-2147412989" = "Ein Vorgang fehlgeschlagen: Datei war zu groß";

/* CSSMERR_APPLEDL_INVALID_DATABASE_BLOB */
"-2147412988" = "Die internen Informationen (-blob-) einer Schlüsselbund-Datenbank sind ungültig";

/* CSSMERR_APPLEDL_INCOMPATIBLE_DATABASE_BLOB */
"-2147412986" = "Interne Version des Datenformats für die internen Informationen („blob“) einer Datenbank ist ungültig";

/* CSSMERR_APPLETP_HOSTNAME_MISMATCH */
"-2147408896" = "Hostname stimmt nicht überein";

/* CSSMERR_APPLETP_UNKNOWN_CRITICAL_EXTEN */
"-2147408895" = "Nicht interpretierbare Erweiterung als kritisch markiert und bestätigt";

/* CSSMERR_APPLETP_NO_BASIC_CONSTRAINTS */
"-2147408894" = "Erweiterung „Basic Constraints“ ist für die Methode erforderlich, aber nicht verfügbar";

/* CSSMERR_APPLETP_INVALID_CA */
"-2147408893" = "Ungültige „BasicConstraints.CA“";

/* CSSMERR_APPLETP_INVALID_AUTHORITY_ID */
"-2147408892" = "Ungültige Aussteller-Schlüssel-ID";

/* CSSMERR_APPLETP_INVALID_SUBJECT_ID */
"-2147408891" = "Ungültige Inhaber-Schlüssel-ID";

/* CSSMERR_APPLETP_INVALID_KEY_USAGE */
"-2147408890" = "Schlüsselverwendung für die Methode ungültig";

/* CSSMERR_APPLETP_INVALID_EXTENDED_KEY_USAGE */
"-2147408889" = "Erweiterte Schlüsselverwendung für die Methode ungültig";

/* CSSMERR_APPLETP_INVALID_ID_LINKAGE */
"-2147408888" = "Ungültige Schlüssel-ID-Verbindung zwischen Antragsteller/Aussteller";

/* CSSMERR_APPLETP_PATH_LEN_CONSTRAINT */
"-2147408887" = "„PathLengthConstraint“ überschritten";

/* CSSMERR_APPLETP_INVALID_ROOT */
"-2147408886" = "Zertifikat-Gruppe beendet bei einem Root-Zertifikat, bei dem die Eigenprüfung fehlschlug";

/* CSSMERR_APPLETP_CRL_EXPIRED */
"-2147408885" = "CRL abgelaufen/noch nicht gültig";

/* CSSMERR_APPLETP_CRL_NOT_FOUND */
"-2147408883" = "Keine geeignete CRL gefunden";

/* CSSMERR_APPLETP_CRL_SERVER_DOWN */
"-2147408882" = "Der angegebene CRL-Server ist nicht verfügbar.";

/* CSSMERR_APPLETP_CRL_BAD_URI */
"-2147408881" = "Unlesbare URL für CRL-Verteilerpunkt";

/* CSSMERR_APPLETP_UNKNOWN_CERT_EXTEN */
"-2147408880" = "Unbekannte kritische Erweiterung „Zertifikat/CRL“";

/* CSSMERR_APPLETP_CRL_NOT_TRUSTED */
"-2147408878" = "CRL nicht für Anker oder Wurzel überprüfbar";

/* CSSMERR_APPLETP_CRL_INVALID_ANCHOR_CERT */
"-2147408877" = "CRL auf nicht-vertrauenswürdige Wurzel überprüft";

/* CSSMERR_APPLETP_CRL_POLICY_FAIL */
"-2147408876" = "Überprüfung der Richtlinien für CRL fehlgeschlagen";

/* CSSMERR_APPLETP_IDP_FAIL */
"-2147408875" = "Verletzung der Erweiterung „IssuingDistributionPoint“";

/* CSSMERR_APPLETP_CERT_NOT_FOUND_FROM_ISSUER */
"-2147408874" = "Zertifikat wurde nicht bei angegebenem „issuerAltName“ gefunden";

/* CSSMERR_APPLETP_BAD_CERT_FROM_ISSUER */
"-2147408873" = "Ungültiges Zertifikat von angegebenem „issuerAltName“ erhalten";

/* CSSMERR_APPLETP_SMIME_EMAIL_ADDRS_NOT_FOUND */
"-2147408872" = "S/MIME E-Mail-Adresse stimmt nicht überein";

/* CSSMERR_APPLETP_SMIME_BAD_EXT_KEY_USE */
"-2147408871" = "Geeignete „S/MIME ExtendedKeyUsage“ nicht gefunden";

/* CSSMERR_APPLETP_SMIME_BAD_KEY_USE */
"-2147408870" = "Inkompatibilität bei S/MIME „KeyUsage“";

/* CSSMERR_APPLETP_SMIME_KEYUSAGE_NOT_CRITICAL */
"-2147408869" = "S/MIME, Zertifikat mit „KeyUsage“ markiert als kritisch";

/* CSSMERR_APPLETP_SMIME_NO_EMAIL_ADDRS */
"-2147408868" = "S/MIME, Blatt mit leerem Inhabernamen und ohne E-Mail-Adresse * in „SubjectAltName“";

/* CSSMERR_APPLETP_SMIME_SUBJ_ALT_NAME_NOT_CRIT */
"-2147408867" = "S/MIME, Blatt mit leerem Inhabernamen, „SubjectAltName“ * nicht kritisch";

/* CSSMERR_APPLETP_SSL_BAD_EXT_KEY_USE */
"-2147408866" = "Geeignete „SSL ExtendedKeyUsage“ nicht gefunden";

/* CSSMERR_APPLETP_OCSP_BAD_RESPONSE */
"-2147408865" = "OCSP-Antwort nicht überprüfbar";

/* CSSMERR_APPLETP_OCSP_BAD_REQUEST */
"-2147408864" = "OCSP-Anfrage nicht überprüfbar";

/* CSSMERR_APPLETP_OCSP_UNAVAILABLE */
"-2147408863" = "OCSP-Dienst nicht verfügbar";

/* CSSMERR_APPLETP_OCSP_STATUS_UNRECOGNIZED */
"-2147408862" = "OCSP-Status: Zertifikat unbekannt";

/* CSSMERR_APPLETP_INCOMPLETE_REVOCATION_CHECK */
"-2147408861" = "Widerrufungs-Überprüfung nicht für jedes Zertifikat erfolgreich";

/* CSSMERR_APPLETP_NETWORK_FAILURE */
"-2147408860" = "Allgemeiner Netzwerkfehler";

/* CSSMERR_APPLETP_OCSP_NOT_TRUSTED */
"-2147408859" = "OCSP-Antwort: „Anchor“ oder „Root“ nicht überprüfbar";

/* CSSMERR_APPLETP_OCSP_INVALID_ANCHOR_CERT */
"-2147408858" = "OCSP-Antwort: Nicht vertrauenswürdige „Root“ festgestellt";

/* CSSMERR_APPLETP_OCSP_SIG_ERROR */
"-2147408857" = "OCSP-Antwort: Signaturfehler";

/* CSSMERR_APPLETP_OCSP_NO_SIGNER */
"-2147408856" = "Kein Unterzeichner für OCSP-Antwort gefunden";

/* CSSMERR_APPLETP_OCSP_RESP_MALFORMED_REQ */
"-2147408855" = "OCSP-Antwortstatus: Anfrage ungültig";

/* CSSMERR_APPLETP_OCSP_RESP_INTERNAL_ERR */
"-2147408854" = "OCSP-Antwortstatus: Interner Fehler";

/* CSSMERR_APPLETP_OCSP_RESP_TRY_LATER */
"-2147408853" = "OCSP-Antwortstatus: Später versuchen";

/* CSSMERR_APPLETP_OCSP_RESP_SIG_REQUIRED */
"-2147408852" = "OCSP-Antwortstatus: Signatur erforderlich";

/* CSSMERR_APPLETP_OCSP_RESP_UNAUTHORIZED */
"-2147408851" = "OCSP-Antwortstatus: Nicht berechtigt";

/* CSSMERR_APPLETP_OCSP_NONCE_MISMATCH */
"-2147408850" = "OCSP-Antwort stimmt derzeit nicht mit der Anfrage überein";

/* CSSMERR_APPLETP_CS_BAD_CERT_CHAIN_LENGTH */
"-2147408849" = "Länge der Zertifikatskette für Code-Signing ungültig";

/* CSSMERR_APPLETP_CS_NO_BASIC_CONSTRAINTS */
"-2147408848" = "Basic Constraints für Code-Signing fehlen";

/* CSSMERR_APPLETP_CS_BAD_PATH_LENGTH */
"-2147408847" = "PathLengthConstraint für Code-Signing ungültig";

/* CSSMERR_APPLETP_CS_NO_EXTENDED_KEY_USAGE */
"-2147408846" = "ExtendedKeyUsage für Code-Signing fehlt";

/* CSSMERR_APPLETP_CODE_SIGN_DEVELOPMENT */
"-2147408845" = "Entwicklungsstil Code-Signing-Zertifikat entdeckt";

/* CSSMERR_APPLETP_RS_BAD_CERT_CHAIN_LENGTH */
"-2147408844" = "Länge der Zertifikatskette für Resource-Signing ungültig";

/* CSSMERR_APPLETP_RS_BAD_EXTENDED_KEY_USAGE */
"-2147408843" = "Erweiterte Schlüsselverwendung für Resource-Signing ungültig";

/* CSSMERR_APPLETP_TRUST_SETTING_DENY */
"-2147408842" = "Vertrauenseinstellung: Ablehnen";

/* CSSMERR_APPLETP_INVALID_EMPTY_SUBJECT */
"-2147408841" = "Ungültig: Ohne SubjectName";

/* CSSMERR_APPLETP_UNKNOWN_QUAL_CERT_STATEMENT */
"-2147408840" = "Unbekannte kritische Qualified Certificate Statement ID";

/* CSSMERR_APPLE_DOTMAC_REQ_QUEUED */
"-2147408796" = "Zertifikatanfrage in Warteliste";

/* CSSMERR_APPLE_DOTMAC_REQ_REDIRECT */
"-2147408795" = "Zertifikatanfrage umgeleitet";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ERR */
"-2147408794" = "Server meldet: Allgemeiner Fehler";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_PARAM */
"-2147408793" = "Server meldet: Parameterfehler";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_AUTH */
"-2147408792" = "Server meldet: Identifizierungsfehler";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_UNIMPL */
"-2147408791" = "Server meldet: Nicht implementiert";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_NOT_AVAIL */
"-2147408790" = "Server meldet: Nicht verfügbar";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ALREADY_EXIST */
"-2147408789" = "Server meldet: Existiert bereits";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_SERVICE_ERROR */
"-2147408788" = "Server meldet: Dienstfehler";

/* CSSMERR_APPLE_DOTMAC_REQ_IS_PENDING */
"-2147408787" = "Anfrage bereits gesendet für angegebenen Benutzer";

/* CSSMERR_APPLE_DOTMAC_NO_REQ_PENDING */
"-2147408786" = "Keine Anfrage gesendet für angegebenen Benutzer";

/* CSSMERR_APPLE_DOTMAC_CSR_VERIFY_FAIL */
"-2147408785" = "CSR konnte nicht überprüft werden.";

/* CSSMERR_APPLE_DOTMAC_FAILED_CONSISTENCY_CHECK */
"-2147408784" = "Serverbericht: Konsistenzprüfung fehlgeschlagen";

/* errSecCSUnimplemented */
"-67072" = "Nicht implementierte Code-Signing-Funktion";

/* errSecCSInvalidObjectRef */
"-67071" = "Ungültige API-Objekt-Referenz";

/* errSecCSInvalidFlags */
"-67070" = "ungültige oder unpassende API-Flag(s) angegeben";

/* errSecCSObjectRequired */
"-67069" = "Ein benötigtes Verweis-Argument war „NULL“";

/* errSecCSStaticCodeNotFound */
"-67068" = "Code-Objekt wurde auf der Festplatte nicht gefunden";

/* errSecCSUnsupportedGuestAttributes */
"-67067" = "Keine Gäste mit diesen Attributwerten gefunden";

/* errSecCSInvalidAttributeValues */
"-67066" = "Angegebene Attributwerte sind ungültig";

/* errSecCSNoSuchCode */
"-67065" = "Der Host hat keinen Gast mit den angeforderten Attributen.";

/* errSecCSMultipleGuests */
"-67064" = "Host hat mehrere Gäste mit diesem Attributwert";

/* errSecCSGuestInvalid */
"-67063" = "Code-Identität ist nicht mehr gültig";

/* errSecCSUnsigned */
"-67062" = "Code-Objekt ist nicht signiert";

/* errSecCSSignatureFailed */
"-67061" = "Code oder Signatur wurde verändert";

/* errSecCSSignatureNotVerifiable */
"-67060" = "Die Signatur kann nicht gelesen werden, z. B. weil das Dateisystem den Root-Benutzer einem unprivilegierten Benutzer zuordnet.";

/* errSecCSSignatureUnsupported */
"-67059" = "Nicht unterstützter Typ oder Version für Signatur";

/* errSecCSBadDictionaryFormat */
"-67058" = "Eine benötigte plist-Datei oder Ressource ist ungültig";

/* errSecCSResourcesNotSealed */
"-67057" = "Ressourcen sind nicht durch Signatur geschützt";

/* errSecCSResourcesNotFound */
"-67056" = "Geschützte Ressource wurde im Code nicht gefunden";

/* errSecCSResourcesInvalid */
"-67055" = "Das Verzeichnis der versiegelten Ressource ist ungültig.";

/* errSecCSBadResource */
"-67054" = "Eine versiegelte Ressource fehlt oder ist ungültig.";

/* errSecCSResourceRulesInvalid */
"-67053" = "Ungültige Regel(n) zur Ressourcen-Auswahl";

/* errSecCSReqInvalid */
"-67052" = "Code-Anforderung(en) ungültig oder beschädigt";

/* errSecCSReqUnsupported */
"-67051" = "Nicht unterstützter Typ oder Version für Code-Anforderung(en)";

/* errSecCSReqFailed */
"-67050" = "Code-Anforderung(en) nicht erfüllt";

/* errSecCSBadObjectFormat */
"-67049" = "Format der Objektdatei ist ungültig oder ungeeignet";

/* errSecCSInternalError */
"-67048" = "Interner Fehler im Untersystem der Code-Signierung";

/* errSecCSHostReject */
"-67047" = "Code hat den Host abgelehnt";

/* errSecCSNotAHost */
"-67046" = "Dieser Code ist kein Host.";

/* errSecCSSignatureInvalid */
"-67045" = "Ungültiges Signaturformat";

/* errSecCSHostProtocolRelativePath */
"-67044" = "Verletzung des Host-Protokolls - Absoluter Gastpfad erforderlich";

/* errSecCSHostProtocolContradiction */
"-67043" = "Verletzung des Host-Protokolls - Widersprüchliche Host-Modi";

/* errSecCSHostProtocolDedicationError */
"-67042" = "Verletzung des Host-Protokolls - Operation für/mit dem angegeben Gat nicht erlaubtt";

/* errSecCSHostProtocolNotProxy */
"-67041" = "Verletzung des Host-Protokolls - Proxy-Hosting nicht aktiviert";

/* errSecCSHostProtocolStateError */
"-67040" = "Verletzung des Host-Protokolls - Ungültige Anfrage auf Änderung des Gaststatus";

/* errSecCSHostProtocolUnrelated */
"-67039" = "Verletzung des Host-Protokolls - Der angegebene Gast ist kein Gast des angegebenen Hosts";

/* errSecCSInvalidOperation */
"-67038" = "Gewünschter Vorgang ist ungültig";

/* errSecCSNotSupported */
"-67037" = "Vorgang wird für diesen Code-Typ nicht unterstützt";

/* errSecCSCMSTooLarge */
"-67036" = "Signatur zu groß zum Einbetten";

/* errSecCSHostProtocolInvalidHash */
"-67035" = "Verletzung des Host-Protokolls - Ungültiger Gast-Hash";

/* errSecCSStaticCodeChanged */
"-67034" = "das Programm auf der Festplatte entspricht nicht dem, das ausgeführt wird";

/* errSecCSSigDBDenied */
"-67033" = "Zugriff auf Signatur-Datenbank verweigert";

/* errSecCSSigDBAccess */
"-67032" = "kein Zugriff auf Signatur-Datenbank";

/* errSecCSHostProtocolInvalidAttribute */
"-67031" = "Host gab ungültige oder inkonsistente Gastattribute zurück";

/* errSecMisc_dskFulErr */
"-34" = "Das Volume ist voll.";

/* errSecMisc_nsvErr */
"-35" = "Das Medium wurde nicht gefunden. Möglicherweise wurde es ausgeworfen.";

/* errSecMisc_bdNamErr */
"-37" = "Versuch, eine Datei zu öffnen, deren Name ein ungültiges Zeichen enthält";

/* errSecMisc_fnfErr */
"-43" = "Die Datei konnte nicht gefunden werden.";

/* errSecMisc_wPrErr */
"-44" = "Das Volume ist schreibgeschützt.";

/* errSecMisc_fLckdErr */
"-45" = "Die Datei ist geschützt.";

/* errSecMisc_vLckdErr */
"-46" = "Das Volume ist geschützt.";

/* errSecMisc_fBsyErr */
"-47" = "Die Datei wird verwendet. Möglicherweise wird sie von einem anderen Programm verwendet.";

/* errSecMisc_dupFNErr */
"-48" = "Es existiert bereits eine Datei unter diesem Namen.";

/* errSecMisc_opWrErr */
"-49" = "Die Datei ist bereits mit Schreiberlaubnis geöffnet.";

/* errSecMisc_volOffLinErr */
"-53" = "Das Volume ist nicht mehr verfügbar. Möglicherweise wurde es ausgeworfen.";

/* errSecMisc_permErr */
"-54" = "Die Datei konnte nicht geöffnet werden. Möglicherweise wird sie von einem anderen Programm verwendet.";

/* errSecMisc_extFSErr */
"-58" = "Dieses Volume ist anscheinend nicht kompatibel.";

/* errSecMisc_wrPermErr */
"-61" = "Datei konnte nicht geschrieben werden. Möglicherweise wurde sie nicht mit ausreichenden Zugriffsrechten geöffnet.";

/* errSecMisc_offLinErr */
"-65" = "Das Speichermedium ist nicht mehr verfügbar. Möglicherweise wurde es ausgeworfen.";

/* errSecMisc_dirNFErr */
"-120" = "Das Verzeichnis konnte nicht gefunden werden.";

/* errSecMisc_volGoneErr */
"-124" = "Das Servervolume ist nicht mehr verfügbar. Möglicherweise wurde es ausgeworfen.";

/* errSecMisc_userCanceledErr */
"-128" = "Der Vorgang wurde vom Benutzer abgebrochen.";

/* errSecMisc_resNotFound */
"-192" = "Eine benötigte Ressource wurde nicht gefunden.";

/* errSecMisc_resFNotFound */
"-193" = "Eine erforderliche Ressource fehlt oder ist beschädigt.";

/* errSecMisc_icNoURLErr */
"-673" = "Der angegebene Ort (URL) ist von unbekanntem Typ oder enthält nicht genügend Informationen.";

/* errSecMisc_icConfigNotFoundErr */
"-674" = "Das Hilfsprogramm zum Öffnen der angegebenen URL wurde nicht gefunden.";

/* errSecMisc_cantGetFlavorErr */
"-1854" = "Der Ort (URL) dieses Objekts fehlt oder ist nicht korrekt formatiert.";

/* errSecMisc_afpAccessDenied */
"-5000" = "Der Zugriff auf dieses Objekt wurde verweigert.";

/* errSecMisc_afpUserNotAuth */
"-5023" = "Die Identifizierung ist fehlgeschlagen. Möglicherweise hat sich das Kennwort für diesen Server geändert, nachdem das Objekt dem Schlüsselbund hinzugefügt wurde.";

